# 1. მოცემული 3 მთელი a, b, c ̸= 0 რიცხვებისთვის მოძებნეთ a და
# b რიცხვებს შორის მოხვედრილი c რიცხვის ჯერადი რიცხვების
# რაოდენობა ყველა შესაძლო ვარიანტისთვის. თუ რომელიმე
# a, b-დან ჯერადია c-ს, მაშინ ჩათვალეთ შესაბამისი საზღვარი.
# მოიფიქრეთ ამოცანის ამოხსნის ალგორითმი, დაწერეთ და გაუშვით პროგრამა 
# ციკლის და რეკურსიის (აგრეთვე range) კონსტრუქციის გამოყენების გარეშე.


def nums(a,b,c):
    max_AB = max(a, b)
    min_AB = min(a, b)

    if c == 0:
        return 0
    
    count = 0
    if min_AB % c == 0:
        count += 1
    if max_AB % c == 0:
        count += 1

    for num in range(min_AB + 1, max_AB):
        if num % c == 0:
            count += 1
            
    return count

print("ჯერადი რიცხვების რაოდენობა: ", nums(int(input("შეიყვანეთ a: ")), 
                                            int(input("შეიყვანეთ b: ")), 
                                            int(input("შეიყვანეთ c: "))
                                            ))